The solution is failing to do the elements Phases are compatible.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FailToDoCompatiblePhaseWarning { get; }
  Visual Basic
Public Shared ReadOnly Property FailToDoCompatiblePhaseWarning As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FailToDoCompatiblePhaseWarning {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures AutoRouteFailures Class
  Autodesk.Revit.DB Namespace